# Conductor Material Methods

Source: https://www.revitapidocs.com/2026/330d948f-4043-1300-75f3-01d610f3b829.htm

---

| Conductor Material Methods |
| --- |

The ConductorMaterial type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Material. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetConductorMaterial | Gets the Conductor Material data by given Conductor Material id. |
|  | GetConductorMaterialIdByName | Gets the Conductor Material id by given Conductor Material name. |
|  | GetConductorMaterialIds | Gets all the Conductor Material ids in the given document, sorted by name. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace